// За рождения си ден Любомир получил аквариум с формата на паралелепипед.
// Първоначално приемаме, като вход размерите му – дължина, широчина и височина в сантиметри.
// Трябва да се пресметне, колко литра вода ще събира аквариума, ако се знае, че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа.
// Един литър вода се равнява на един кубичен дециметър/ 1л = 1дм3/.
// Да се напише функция, която изчислява литрите вода, която са необходими за напълването на аквариума.

//  Вход

//  Функцията приема 4 аргумента:
//  1.	Дължина в см    –  число в интервала [10 … 500]
//  2.	Широчина в см   –  число в интервала [10 … 300]
//  3.	Височина в см   –  число в интервала [10… 200]
//  4.	Процент         –  число в интервала [0.000 … 100.000]

//  Изход

// Да се отпечата на конзолата едно число:
//  литрите вода, които ще  събира аквариума.
//length = input[0], width = input[1], height = input[2], percentage= input[3]

function solve(input){
  l = Number(input[0]);
  w = Number(input[1]);
  h = Number(input[2]);
  percent = Number(input[3]) / 100;
  capacityInLitres = (l * w * h) / 1000;
  capacityReduction = capacityInLitres * percent;
  console.log(capacityInLitres - capacityReduction);
}
// solve([
//     "85", 
//     "75", 
//     "47", 
//     "17"
// ]);
// solve([
//     "105",
//     "77",
//     "89",
//     "18.5"
// ])
