// В сладкарница се провежда благотворителна кампания за събиране на средства, в която могат да се включат сладкари от цялата страна. 
// Първоначално получаваме броя на дните, в които тече кампанията и броя на сладкарите, които ще се включат. 
// След това получаваме количеството на тортите, гофретите и палачинките, които ще бъдат приготвени от един сладкар за един ден. Трябва да се има предвид следния ценоразпис:
// •	Торта - 45 лв.
// •	Гофрета - 5.80 лв.
// •	Палачинка – 3.20 лв.
//      1/8 от крайната сума ще бъде използвана за покриване на разходите за продуктите по време на кампанията. 
// 
// Да се напише програма, която изчислява сумата, която е събрана в края на кампанията.
// 
// Вход
// Функцията получава 5 аргумента:
// 1.	Броят на дните, в които тече кампанията – цяло число в интервала [0 … 365]
// 2.	Броят на сладкарите – цяло число в интервала [0 … 1000]
// 3.	Броят на тортите – цяло число в интервала [0… 2000]
// 4.	Броят на гофретите – цяло число в интервала [0 … 2000]
// 5.	Броят на палачинките – цяло число в интервала [0 … 2000]
// 
// Изход
// Да се отпечата на конзолата едно число:
// •	парите, които са събрани.
// campaignDays, cookers, cakes, waffles, pancake

function solve(input){
    campaignDays = Number(input[0])
    cookers = Number(input[1])
    cakes = Number(input[2]) * 45
    waffles = Number(input[3]) * 5.80
    pancake = Number(input[4]) * 3.20

    let productionSum = campaignDays * cookers * (cakes + waffles + pancake)
    let charityExpenses = productionSum / 8
    let totalSum = productionSum - charityExpenses
    console.log(`${totalSum}`)
}
solve(["23",
"8",
"14",
"30",
"16"])

solve(["131",
"5",
"9",
"33",
"46"])

